package com.example.tsu_navigator

import com.example.tsu_navigator.EatPlace

enum class PlaceType {
    CAFE,
    CANTEEN,
    SHOP,
}

data class EatPlace(
    val id: String,
    val name: String,
    val type: PlaceType,
    val latitude: Double,
    val longitude: Double,
    val cuisine: String? = null,
    val priceLevel: Int = 2,
    val workingHours: String = "09:00-20:00",
)

object EatPlacesData {
    val places = listOf(
        EatPlace("1", "Буфет в двойке", PlaceType.CANTEEN, 56.468623, 84.945130, "Купить перекус", 1, "10:00-17:00"),
        EatPlace("2", "XO bakery", PlaceType.CAFE, 56.468623, 84.945130, "Кофеек", 2, "08:00-19:00"),
        EatPlace("3", "Сибирские блины в ГК", PlaceType.CAFE, 56.469309, 84.946670, "Блинчики", 1, "09:00-20:00"),
        EatPlace("4", "Ярче на Базарном переулке", PlaceType.SHOP, 56.473924, 84.944715, "Продукты, готовая еда", 1, "07:00-23:00"),
        EatPlace("5", "Starbooks", PlaceType.CAFE, 56.469609, 84.946133, "Кофе, выпечка", 2, "08:00-19:00"),
        EatPlace("6", "100ловая в ГК", PlaceType.CANTEEN, 56.469195, 84.946659, "Покушать полноценно", 1, "09:00-17:00"),
        EatPlace("7", "Минутка в ГК", PlaceType.CANTEEN, 56.469195, 84.946659, "Покушать полноценно", 2, "10:00-17:00"),
        EatPlace("8", "Rostic's", PlaceType.CAFE, 56.469132, 84.951294, "Бургеры", 2, "09:00-23:00"),
        EatPlace("9", "Белка", PlaceType.CAFE, 56.471144, 84.950208, "Кофеек", 1, "08:00-20:00"),
        EatPlace("10", "У мамы", PlaceType.CANTEEN, 56.473644, 84.943693, "Поесть полноценно", 1, "10:00-17:00"),
        EatPlace("11", "Магнолия", PlaceType.CAFE, 56.473277, 84.944476, "Купить перекус", 2, "09:00-20:00"),
        EatPlace("12", "Укромное местечко", PlaceType.CANTEEN, 56.472468, 84.948580, "Можно полноценно покушать", 2, "09:00-17:00"),
        EatPlace("13", "Сибирские блины на Новосе", PlaceType.CAFE, 56.472604, 84.950857, "Блинчики", 2, "11:00-21:00"),
        EatPlace("14", "33 пингвина", PlaceType.CAFE, 56.472649, 84.955344, "Мороженка", 2, "10:00-22:00"),
        EatPlace("15", "Resto-место Ближе", PlaceType.CAFE, 56.471668, 84.952244, "Полноценная еда", 2, "07:30-00:00"),
        EatPlace("16", "Вечный зов", PlaceType.CAFE, 56.471212, 84.952984, "Грузинская кухня", 2, "12:00-01:00"),
        EatPlace("17", "Baba Roma", PlaceType.CAFE, 56.471158, 84.951114, "Сладкое, кофеек выпить", 2, "08:00-21:00"),
        EatPlace("18", "Шашлычный дом", PlaceType.CAFE, 56.463838, 84.940063, "Шашлычок", 2, "00:00-23:59"),
        EatPlace("19", "Poly bistro", PlaceType.CAFE, 56.465121, 84.953774, "Ресторан, полноценный прием пищи", 2, "09:00-00:00"),
        EatPlace("20", "Пешком постою", PlaceType.CAFE, 56.464841, 84.953886, "Грузинская кухня", 2, "11:00-21:00"),
        EatPlace("21", "Ребро", PlaceType.CAFE, 56.464841, 84.953886, "Бургеры и ребрышки", 2, "11:00-23:00"),
        EatPlace("22", "COFFEE LIKE", PlaceType.CAFE, 56.463960, 84.953441, "Кофеек", 2, "07:15-22:00"),
        EatPlace("23", "Пончики на Усова", PlaceType.CAFE, 56.463961, 84.953348, "Пончики", 2, "10:00-22:00"),
        EatPlace("24", "Прожарка", PlaceType.CAFE, 56.463908, 84.952955, "Шаурма", 2, "10:00-22:00"),
        EatPlace("25", "Rocket Coffee", PlaceType.CAFE, 56.463908, 84.952955, "Кофеек", 2, "07:30-22:00"),
        EatPlace("26", "Doner master", PlaceType.CAFE, 56.463884, 84.951828, "Шаурма", 2, "00:00-23:59"),
        EatPlace("27", "Сибирские блины рядом с фейсом", PlaceType.CAFE, 56.463910, 84.951481, "Блинчики", 2, "00:00-23:59"),
        EatPlace("28", "Yoki Toki", PlaceType.CAFE, 56.464189, 84.956158, "Азиатская кухня", 2, "10:00-22:00"),
        EatPlace("29", "Буланже", PlaceType.CAFE, 56.466257, 84.955419, "Кофеек, десертики", 2, "09:00-22:00"),
        EatPlace("30", "Гербарий", PlaceType.CAFE, 56.470119, 84.951495, "Полноценный прием пищи", 2, "09:00-23:00"),
        EatPlace("31", "Безумно", PlaceType.CAFE, 56.471438, 84.941142, "Шаурма", 2, "10:00-22:00"),
        EatPlace("32", "Батина шаурма", PlaceType.CAFE, 56.471173, 84.941368, "Шаурма", 2, "10:00-23:00"),
        EatPlace("33", "Точка", PlaceType.CAFE, 56.471438, 84.941142, "Кофеек", 2, "09:00-20:00"),
        EatPlace("34", "Буфет в 4 корпсе", PlaceType.CANTEEN, 56.470148, 84.942673, "Купить на перекус", 2, "10:00-17:00"),
        EatPlace("35", "Абрикос", PlaceType.SHOP, 56.471457, 84.941113, "Продукты", 2, "08:00-23:00"),
        EatPlace("36", "Пилад", PlaceType.SHOP, 56.472113, 84.943253, "Продукты", 2, "00:00-23:59"),
        EatPlace("37", "Красное и белое", PlaceType.SHOP, 56.473679, 84.943559, "Продукты, ну и вы сами поняли", 2, "10:00-22:05"),
        EatPlace("38", "Мария-Ра", PlaceType.SHOP, 56.464443, 84.940573, "Продукты", 2, "09:00-22:00"),
        EatPlace("39", "Пятерочка", PlaceType.SHOP, 56.463889, 84.951885, "Продукты", 2, "00:00-23:59"),
        EatPlace("40", "Ярче на Кирова", PlaceType.SHOP, 56.466244, 84.954892, "Продукты", 2, "07:00-23:00"),
        EatPlace("41", "Наш", PlaceType.SHOP, 56.471485, 84.953657, "Продукты", 2, "00:00-23:59"),
        EatPlace("42", "Ярче на Советской", PlaceType.SHOP, 56.471477, 84.953704, "Продукты", 2, "08:00-22:00"),
    )
}
